Repository: Frozen-Burrito/hydrate-app
Catalog: lib/l10n/app_*.arb
Languages: es

source: Home
es: Inicio

source: Resources
es: Recursos

source: History
es: Historial

source: Discover
es: Descubrir

source: Bookmarks
es: Marcados

source: Published
es: Publicación

# resourcesErr
source: An error occurred while retrieving the resources.
es: Hubo un error obteniendo los recursos informativos

# resourcesUnavailable
source: There are no informative resources available. Try again later.
es: No hay recursos informativos disponibles. Intenta más tarde

# noBookmarks
source: You have not bookmarked any articles yet
es: Aún no has guardado recursos informativos

source: Resource removed
es: Artículo removido

# resourceAdded
source: Resource bookmarked
es: Artículo marcado

# resourceNotRemoved
source: Couldn't remove the resource
es: No se pudo remover el artículo

# resourceNotAdded
source: Couldn't bookmark the resource
es: No se pudo marcar el artículo

source: No date
es: Sin fecha

source: Hydration
es: Hidratación

source: Activity
es: Actividad

# actTypeWalk
source: Walk
es: Caminar

# actTypeRun
source: Run
es: Correr

# actTypeCycle
source: Bicycle
es: Andar en bicicleta

# actTypeSwim
source: Swim
es: Nadar

# actTypeSoccer
source: Soccer
es: Fútbol

# actTypeBasketball
source: Basketball
es: Básquetbol

# actTypeVolleyball
source: Volleyball
es: Volleybol

# actTypeDance
source: Dance
es: Danza

# noActTypes
source: No activity types found
es: No se encontraron tipos de actividad

# noActivityRecords
source: You haven´t recorded any activities yet. When you create one, you will find it here
es: No has creado registros de actividad aún. Cuando crees uno, lo podrás ver aquí.

# errorFetchingActivity
source: An error occurred while trying to get your activity records. Please try later.
es: Ocurrió un error al intentar obtener tus registros de actividad. Intenta más tarde.

# noHydrationRecordsYet
source: There are no records of hydration yet.
es: Aún no hay registros de tu hidratación.

# drinkAndComeBackLater
source: Drink water and come back later.
es: Toma agua y vuelve más tarde.

# errorFetchingHydration
source: An error occurred while trying to get your hydration records.
es: Ocurrió un error al intentar obtener registros de hidratación.

# exceedsHydration
source: Excess of liquids
es: Exceso de líquidos

# stableHydration
source: Hydration is stable
es: Líquidos estables

source: Medical report
es: Reporte médico

# yourMedicalData
source: Your medical report data for this day:
es: Tus datos médicos para este día:

source: Hypervolemia
es: Hipervolemia

source: Post-dialysis weight
es: Peso post-diálisis

source: Extracellular water
es: Agua extracelular

source: Recommended gain
es: Ganancia recomendada

source: Real gain
es: Ganancia real

source: Yes
es: Sí

# continueAction
source: Continue
es: Continuar

# confirmAction
source: Confirm
es: Confirmar

source: Cancel
es: Cancelar

source: Create
es: Crear

source: Select
es: Selecciona

source: Save
es: Guardar

source: Skip
es: Omitir

source: Replace
es: Reemplazar

# purchaseFor
source: Unlock for
es: Comprar por

source: Don't show again
es: No volver a mostrar

source: Accept
es: Aceptar

source: Reject
es: Rechazar

source: You have
es: Tienes

# dateFrom
source: From
es: Desde

# dateTo
source: to
es: hasta

source: Today
es: Hoy

source: Yesterday
es: Ayer

source: meters
es: metros

source: minutes
es: minutos

source: mililiters
es: mililitros

source: liters
es: litros

source: kilograms
es: kilogramos

source: kilocalories
es: kilocalorías

source: coins
es: monedas

source: day
es: día

source: week
es: semana

source: month
es: mes

source: Settings
es: Configuración

# batteryHeading
source: Device Battery Level
es: Batería del Dispositivo

# lastUpdate
source: Last updated on
es: Última actualización

# theme
source: Color theme
es: Tema de color

# themeOptSys
source: System
es: Sistema

# themeOptLight
source: Light
es: Claro

# themeOptDark
source: Dark
es: Oscuro

# contributeData
source: Contribute to open data
es: Contribuir a datos abiertos

# contributeDataTooltipSignedIn
source: Send anonymous statistical data weekly
es: Envía datos estadísticos semanalmente

# contributeDataTooltipSignedOut
source: You need a user account to contribute data
es: Necesitas una cuenta de usuario para aportar datos

source: Notifications
es: Notificaciones

# notifOptNone
source: None
es: Ninguna

# notifOptGoals
source: Goals
es: Metas

# notifOptBattery
source: Low battery
es: Batería baja

# notifOptActivity
source: Activity & routine reminders
es: Actividad y rutinas

# notifyRest
source: Rest reminders
es: Recordatorios de descanso

# notifOptAll
source: All notifications
es: Todas las notificaciones

# notifCountActive
source: enabled
es: activadas

# setupNotifyDetails
source: Choose the types of notifications which you wish to receive:
es: Selecciona los tipos de notificaciones que deseas recibir:

# integrateHealthApps
source: Connect health apps
es: Conectar apps de salud

# integrateGoogleFit
source: Connect Hydrate with Google Fit
es: Integra Hydrate con Google Fit

source: Sign in with Google
es: Inicia Sesión con Google

# signOutWithGoogle
source: Sign out of your Google account
es: Cerrar sesión de la cuenta de Google

# fetchGoogleFit
source: Sync with Google Fit
es: Actualizar datos de Google Fit

# googleFitUpdated
source: Synced data with Google Fit
es: Google Fit sincronizado

# googleFitAlreadyUpToDate
source: Hydrate is already up to date with Google Fit
es: Hydrate ya está al día con Google Fit

source: Weekly forms
es: Formularios semanales

source: Send comments
es: Enviar comentarios

source: User guides
es: Guías de usuario

source: Version
es: Versión

# unsavedChanges
source: There are unsaved settings modifications
es: Tienes ajustes modificados sin guardar

# disconnected
source: Not paired
es: Desconectado

# pairDevice
source: Pair a Device
es: Conecta un Dispositivo

# tryReconnect
source: Try to pair again
es: Intentar reconexión

# disconnectDevice
source: Disconnect from device
es: Desconecta el dispositivo

# bleNotAvailable
source: The device's BlueTooth adapter is not available
es: El adaptador BlueTooth del dispositivo móvil no está disponible

# tryLocAndBt
source: Try to enable it or give location and BlueTooth permissions to the app
es: Intenta activarlo o otorgar permisos de ubicación y BlueTooth a la app

# noPairedDeviceYet
source: You haven't paired a Hydrate device yet
es: Aún no has emparejado una extensión Hydrate

# checkDeviceList
source: Check the device list below to discover nearby devices
es: Revisa la lista inferior para descubrir dispositivos cercanos

source: Connected device
es: Dispositivo conectado

# cannotConnectDevice
source: Couldn't pair with chosen device
es: El dispositivo no pudo ser conectado

# deviceWasPaired
source: Device pairing successful
es: El dispositivo fue emparejado correctamente

source: Available devices
es: Dispositivos disponibles

# scan
source: Scan for devices
es: Descubrir dispositivos

# stopScan
source: Stop device discovery
es: Detener escaneo

source: Forget device
es: Olvidar dispositivo

# setupAutoconnect
source: Enable autoconnect
es: Activar conexión automática

# askSetupAutoconnect
source: Enable automatic pairing?
es: ¿Activar conexión automática?

# askSetupAutoconnectDetails
source: Do you want this app to automatically try to pair with this device in the future?
es: ¿Deseas que la app intente conectarse al dispositivo de forma automática en el futuro?

# continueWithoutAutoconnect
source: Continue without auto pairing
es: Continuar sin autoconexión

source: Sign In
es: Iniciar Sesión

source: Sign Out
es: Cerrar Sesión

source: Don't
es: ¿No

source: Already
es: ¿Ya

# haveAccount
source: have an account?
es: tienes una cuenta?

source: Sign Up
es: Regístrate

source: Create Account
es: Crea una cuenta

# profileCreationError
source: An error occurred while trying to setup your profile
es: Ocurrió un error al intentar crear tu perfil

# noProfileSelected
source: There is no selected user profile
es: No hay un perfil de usuario seleccionado

# askAccountLink
source: Would you like to link this account with your local user profile?
es: ¿Asociar cuenta con el perfil local de usuario?

# profileHasNoLinkedAccount
source: Your local user profile has no user account linked to it
es: Tu perfil de usuario local no tiene una cuenta asociada

# accountLinkBenefits
source: Linking an account allows you to use your profile on multiple devices
es: Asociar una cuenta te permite acceder a tu perfil desde varios dispositivos

# continueWithoutLink
source: Continue without linking
es: Continuar sin asociar

# linkProfileToAccount
source: Link profile
es: Asociar perfil

source: Prefer not to say
es: Prefiero no especificar

source: Other
es: Otro

source: Username
es: Nombre de usuario

source: Email or username
es: Email o nombre de usuario

source: Password
es: Contraseña

# passwordConfirm
source: Confirm password
es: Confirma la contraseña

source: Date of birth
es: Fecha de nacimiento

source: Gender
es: Sexo

# genderMan
source: Man
es: Hombre

# genderWoman
source: Woman
es: Mujer

source: Country
es: País

# countryMx
source: Mexico
es: México

# countryUs
source: United States
es: Estados Unidos

source: Height
es: Altura

source: Weight
es: Peso

# medicalCondition
source: Medical conditions
es: Condiciones médicas

# condNone
source: None
es: Ninguna

# condRenalInsuf
source: Renal Insufficiency
es: Insuficiencia Renal

# condNephriticSynd
source: Nephritic Syndrome
es: Síndrome Nefrótico

source: Ideal hydration
es: Hidratación ideal

source: First name
es: Nombre

source: Last name
es: Apellido

# hoursOfActivity
source: Hours of activity or sports
es: Horas por actividad

source: Occupation
es: Ocupación

source: Student
es: Estudiante

source: Office worker
es: Oficinista

source: Manual worker
es: Trabajador manual

source: Parent
es: Padre o madre

source: Athlete
es: Atleta

source: Daily
es: Diario

source: Weekly
es: Semanal

source: Monthly
es: Mensual

# goalTermHint
source: What is your goal's timeline?
es: ¿Cuál es el plazo de tu meta?

# startDate
source: Start
es: Inicio

# endDate
source: End
es: Término

source: Reward
es: Recompensa

source: Amount (ml)
es: Cantidad (ml)

# notesLabel
source: Notes
es: Anotaciones

# notesHint
source: I should drink water whenever I...
es: Debo recordar tomar agua antes de...

# noGoalsYet
source: You haven't set any goals of hydration yet.
es: Aún no has creado metas de hidratación.

# createNewGoal
source: Set a new goal
es: Crea una meta

# errorFetchingGoals
source: An error occurred while trying to get your goals of hydration
es: Ocurrió un error al intentar obtener tus metas de hidratación.

source: Main Goal
es: Meta Principal

# goalCreationError
source: An error occurred while trying to set the new goal
es: Ocurrió un error al intentar crear la meta

# progressToHydrationGoals
source: My progress towards my goals of hydration
es: Mi progreso en mis metas de hidratación

# todayIReachedMyGoal
source: today I reached my goal of drinking
es: Hoy he alcanzado mi meta de tomar

source: of water every
es: de agua natural cada

# imProudOfMyResults
source: I am very proud of my results!
es: ¡Estoy muy orgullos@ de mis resultados!

source: New Activity Record
es: Nuevo Registro de Actividad

# newActivityHint
source: Write the details of the physical activity performed
es: Escribe los detalles de la actividad física realizada

# whatType
source: What kind of activity did you do?
es: ¿Qué tipo de actividad hiciste?

source: Activity title
es: Título de la actividad

# activityTitleHint
source: Went to school in the morning...
es: Ir a la escuela en la mañana

source: Date
es: Fecha

source: Duration
es: Duración

source: Distance
es: Distancia

source: kCal Burned
es: kCal quemadas

# outdoor
source: Outdoors
es: Al aire libre

# recentIntenseActvity
source: Recent intense activity
es: Actividad extenuante reciente

# askGoalReplacement
source: Replace a goal of hydration?
es: ¿Reemplazar una meta?

source: active goal(s)
es: meta(s) activa(s)

# reasonToReplaceGoal
source: In order to set a new goal of hydration, you must replace at least one of your current active goals
es: Para agregar una nueva meta, debes reeemplazar al menos una de ellas

# errUserExists
source: An account already uses this email or username
es: El e-mail o nombre usuario no está disponible

# errIncorrectPassword
source: Password is incorrect
es: La contraseña es incorrecta

# errNoUser
source: The user or password does not match
es: El login o la contraseña no coinciden

# errCheckInternetConn
source: Check your internet connection and try again
es: Revisa tu conexión a internet e intenta de nuevo

# chooseEnvironment
source: Choose a mini environment
es: Selecciona un entorno

source: Loading environments
es: Cargando entornos

# canPurchaseEnvTooltip
source: You can purchase this environment to unlock it
es: Puedes comprar este entorno para desbloquearlo

# notEnoughCoins
source: You don't have enough coins
es: No tienes monedas suficientes

# cannotChooseSameEnv
source: You cannot choose the same environment
es: No puedes elegir el mismo entorno

# firstSteps
source: Get started
es: Primeros pasos

# userGuideDetails
source: The user guides can help you learn how to use this app and your Hydrate device
es: Las guías de usuario son un recurso que te puede ayudar a usar esta app y tu extensión para botellas

# askVisitUserGuides
source: Would you like to consult them now? (You can visit them later)
es: ¿Te gustaría revisarlas ahora?

# goToUserGuides
source: Yes, go to user guides
es: Ir a guía de usuario

source: Monday
es: Lunes

source: Tuesday
es: Martes

source: Wednesday
es: Miércoles

source: Thursday
es: Jueves

source: Friday
es: Viernes

source: Saturday
es: Sábado

source: Sunday
es: Domingo

source: Anonymous Profile
es: Perfil Anónimo

# savingProfile
source: Saving changes to profile
es: Guardando cambios a perfil

# changesSaved
source: Changes were saved
es: Cambios guardados

# modificationLimitReached
source: You have reached the limit of yearly profile modifications
es: Haz alcanzado el límite de modificaciones anuales permitidas

# errorWhileSaving
source: An error occurred while saving changes
es: Ocurrió un error al guardar los cambios

# tryAgain
source: Please try again
es: Intenta de nuevo, por favor

# setGoalFormTitle
source: Set a New Goal
es: Nueva Meta

# setGoalFormDetails
source: Fill in the details of your new hydration goal:
es: Completa los detalles de tu nueva meta de hidratación:

# newActivityFormTitle
source: Record Activity
es: Nueva Actividad

# newActivityFormDetails
source: Specify the details of the activity you performed:
es: Especifica los detalles de la actividad física que realizaste:

# initialFormTitle
source: Welcome
es: Bienvenido

# initialFormDetails
source: Please complete your information to know you better:
es: Completa tu información para conocerte mejor:

# weeklyFormTitle
source: Weekly Review
es: Revisión Semanal

# weeklyFormDetails
source: Please enter the aproximate amount of daily hours, in average, that you dedicated to each one of the following activities during this week:
es: Escribe la cantidad de horas diarias promedio que dedicaste a cada una de las siguientes actividades durante esta semana:

# medicalFormTitle
source: Medical Checkup
es: Chequeo Médico

# medicalFormDetails
source: Please enter the following data with the aid of your nephrologist:
es: Introduce los siguientes datos con apoyo de tu nefrólogo:

# viewNotFound
source: 404: View not found
es: 404: Vista no encontrada

source: characters
es: caracteres

# usernameIsRequiredError
source: The username is required
es: El nombre de usuario es requerido

# usernameTooShortError
source: The username must be longer than
es: El usuario debe tener más de

# usernameTooLongError
source: The username must be shorter than
es: El usuario debe tener menos de

# usernameFormatError
source: The username must contain only lowercase letters or numbers
es: El nombre de usuario debe contener letras minúsculas o números

# emailIsRequiredError
source: The email is required
es: El correo electrónico es requerido

# emailFormatError
source: The email does not have a correct format
es: El correo no tiene un formato válido

# passwordIsRequiredError
source: The password is required
es: La contraseña es requerida

# passwordTooShortError
source: The password must be longer than
es: La contraseña debe tener más de

# passwordTooLongMsg
source: The password must be shorter than
es: La contraseña debe tener menos de

# passwordRequiresSymbolsMsg
source: The password must include at least an uppercase letter and a symbol
es: La contraseña debe incluir al menos un número y una mayúscula

# passwordConfirmIsRequiredMsg
source: The password confirm is required
es: La confirmación de contraseña es requerida

# passwordConfirmDoesNotMatchMsg
source: The password confirmation does not match
es: La confirmación de contraseña no coincide

# activityTitleTooLong
source: The title must be shorter than
es: El título debe tener menos de

# activityDistanceIsTooSmall
source: The distance must be longer than
es: La distancia debe ser mayor a

# activityDistanceExceedsRange
source: The distance must be shorter than
es: La distancia debe ser menor a

# activityDurationIsTooSmall
source: The duration must be longer than
es: La duración debe ser mayor a

# activityDurationExceedsRange
source: The duration must be shorter than
es: La duración debe ser menor a

# activityCaloriesIsTooSmall
source: The kilocalories burned must be more than
es: La cantidad de calorías debe ser mayor a

# activityCaloriesExceedsRange
source: The kilocalories burned must be less than
es: La cantidad de kilocalorías debe ser menor a

# firstNameTooLong
source: The first name must have less than
es: El nombre debe tener menos de

# lastNameTooLong
source: The last name must have less than
es: Los apellidos deben tener menos de

# heightIsNaN
source: The height must be a number
es: La estatura debe ser un número

# heightIsTooSmall
source: The height must be greater than
es: La estatura debe ser mayor a

# heightIsTooLarge
source: The height must be less than
es: La estatura debe ser menor a

# weightIsNaN
source: The weight must be a number
es: El peso debe ser un número

# weightIsTooSmall
source: The weight must be greater than
es: El peso debe ser mayor a

# weightIsTooLarge
source: The weight must be less than
es: El peso debe ser mayor a

# termIsNaN
source: Please choose a valid term
es: Selecciona un plazo válido

# termIsEmpty
source: The term is required
es: El plazo es requerido

# endDateBadFormat
source: The end date does not have a correct format
es: La fecha de término no tiene el formato correcto

# endDateRequired
source: The end date is required
es: La fecha de término es requerida

# endDateBeforeStart
source: The end date must not be before the start date
es: La fecha de término no debe suceder antes que la fecha de inicio

# endDateTooLarge
source: The end date is too far from today
es: La fecha de término es demasiado lejana

# waterAmountIsNaN
source: The amount of water must be a number
es: La cantidad de agua debe ser un número

# waterAmountIsRequired
source: The amount of water is required
es: La cantidad de agua es requerida

# waterAmountTooSmall
source: The amount of water must be greater than
es: La cantidad de agua debe ser mayor a

# waterAmountTooLarge
source: The amount of water must be less than
es: La cantidad de agua debe ser menor a

# rewardIsNaN
source: The coin reward must be a number
es: La recompensa debe ser un número

# rewardIsRequired
source: The coin reward is required
es: La recomensa es requerida

# rewardTooSmall
source: The coin reward must be greater than
es: La recompensa debe ser mayor a

# rewardTooLarge
source: The coin reward must be less than
es: La recompensa debe ser menor a

# tagCountIsNaN
source: The amount of tags must be a number
es: La cantidad de etiquetas debe ser un número

# tagCountIsRequired
source: The amount of tags is required
es: El número de etiquetas es requerido

# tagCountTooSmall
source: The tag count must be greater than
es: El número de etiquetas debe ser mayor a

# tagCountTooLarge
source: The tag count must be less than
es: El número de etiquetas debe ser menor a

# notesAreRequired
source: The notes are required
es: Las notas son requeridas

# notesTooShort
source: The notes must have more than
es: Las notas deben tener más de

# notesTooLong
source: The notes must have less than
es: Las notas deben tener menos de
